a = int(input('a = '))
b = int(input('b = '))
print('%d + %d = %d' % (a, b, a + b))
print('%d - %d = %d' % (a, b, a - b))
print('%d * %d = %d' % (a, b, a * b))
print('%d / %d = %f' % (a, b, a / b))
print('%d // %d = %d' % (a, b, a // b))
print('%d %% %d = %d' % (a, b, a % b))
print('%d ** %d = %d' % (a, b, a ** b))

'''
運算符:描述
[]:下標
[:]:切片
**:指數
~:按位取反 
+ -:正負號
*:乘
/:除
%:餘數
//:整除
+，-:加，減
>>:右移
<<:左移
&:按位與
^，|:按位異或，按位或
<=，<，>，>=:小於等於，小於，大於，大於等於
==，!=:等於，不等於
is，is not:身份運算符
in，not in:成員運算符
not，or，and:邏輯運算符
=，+=，-=，*=，/=，%=，//=，**=，&=:=，^=，>>=，<<=
'''